/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main_cpp.cpp                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: haeem <haeem@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/08/24 13:37:20 by haeem             #+#    #+#             */
/*   Updated: 2022/08/27 13:43:03 by kyko             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>
#include <limits.h>
#include "./ex00/ft_putchar.c"
#include "./ex01/ft_print_alphabet.c"
#include "./ex02/ft_print_reverse_alphabet.c"
#include "./ex03/ft_print_numbers.c"
#include "./ex04/ft_is_negative.c"
//#include "./ex05/ft_print_comb.c"
//#include "./ex06/ft_print_comb2.c"
#include "./ex07/ft_putnbr.c"
#include "./ex08/ft_print_combn.c"
#define fl fflush(stdout)
using namespace std;
int main(void)
{	
	// 단순 출력 문제입니다
	cout<<"°º¤ø,,ø¤º°`°º¤ø, ex 00 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'a'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_putchar('a');cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	

	// 모든 알파벳 출력 문제입니다, 모로 가도 출력만 되면 ok!
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 01 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'abcdefghijklmnopqrstuvwxyz'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_alphabet();cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;


	// 위와 동일하지만 출력을 확인하세요
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 02 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'zyxwvutsrqponmlkjihgfedcba'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_reverse_alphabet();cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;

	// 위와 동일하지만 출력을 확인하세요
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 03 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'0123456789'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_numbers();cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;

	// if문 작성법을 익혀보아요
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 04 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'N'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_is_negative(-1);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'P'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_is_negative(0);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;


	// 동일한 출력이 나오면 ok!
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 05 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'012, 013, 014, 015, 016, 017, 018, 019, 023, 024, 025, 026, 027, 028, 029, 034, 035, 036, 037, 038, 039, 045, 046, 047, 048, 049, 056, 057, 058, 059, 067, 068, 069, 078, 079, 089, 123, 124, 125, 126, 127, 128, 129, 134, 135, 136, 137, 138, 139, 145, 146, 147, 148, 149, 156, 157, 158, 159, 167, 168, 169, 178, 179, 189, 234, 235, 236, 237, 238, 239, 245, 246, 247, 248, 249, 256, 257, 258, 259, 267, 268, 269, 278, 279, 289, 345, 346, 347, 348, 349, 356, 357, 358, 359, 367, 368, 369, 378, 379, 389, 456, 457, 458, 459, 467, 468, 469, 478, 479, 489, 567, 568, 569, 578, 579, 589, 678, 679, 689, 789'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_comb();cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	

	// 문자열과 정수간의 출력 처리에 유의하셔야 합니다
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 06 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'00 01, 00 02, 00 03, 00 04, 00 05, ..., 00 99, 01 02, ..., 97 99, 98 99'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_comb2();cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	

	// 오버플로우 개념에 대해 알아보며 스트링 입출력을 갈고 닦아 봅시다!
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 07 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'-2147483648'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_putnbr(-2147483648);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'-1'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_putnbr(-1);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'0'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_putnbr(0);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'2147483647'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_putnbr(2147483647);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;


	// 재귀함수를 이용하면 문제를 단순화할 수 있습니다!
	cout<<"\n\n°º¤ø,,ø¤º°`°º¤ø, ex 08 ,ø¤°º¤ø,,ø¤º°`°º¤ø,\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'0, 1, 2, 3, 4, 5, 6, 7, 8, 9'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_combn(1);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'01, 02, 03, ..., 09, 12, ..., 79, 89'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_combn(2);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
	cout<<"──────────answer──────────"<<endl;
	cout << "'012, 013, 014, 015, 016, 017, 018, 019, 023, 024, 025, 026, 027, 028, 029, 034, 035, 036, 037, 038, 039, 045, 046, 047, 048, 049, 056, 057, 058, 059, 067, 068, 069, 078, 079, 089, 123, 124, 125, 126, 127, 128, 129, 134, 135, 136, 137, 138, 139, 145, 146, 147, 148, 149, 156, 157, 158, 159, 167, 168, 169, 178, 179, 189, 234, 235, 236, 237, 238, 239, 245, 246, 247, 248, 249, 256, 257, 258, 259, 267, 268, 269, 278, 279, 289, 345, 346, 347, 348, 349, 356, 357, 358, 359, 367, 368, 369, 378, 379, 389, 456, 457, 458, 459, 467, 468, 469, 478, 479, 489, 567, 568, 569, 578, 579, 589, 678, 679, 689, 789'"<<endl;
	cout << "────────────────────────────────────────────────"<<endl;
	cout << "'"; fl;ft_print_combn(3);cout<<"'"<<endl;
	cout<<"──────────output──────────\n\n"<<endl;
}
